app/Controllers/Categories.php

SELECT *
FROM `categories`
WHERE `user_id` = '10'
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        $model = new CategoryModel();

        $data['categories'] = $model
            ->where('user_id', session()->get('user_id'))
            ->findAll();