app/Controllers/Dashboard.php

SELECT SUM(`nominal`) AS `nominal`
FROM `expenses`
WHERE `user_id` = '10'
AND MONTH(tanggal) = '07'
AND YEAR(tanggal) = '2025'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `expenses`
WHERE `user_id` = '10'
SELECT COUNT(*) AS `numrows`
FROM `categories`
WHERE `user_id` = '10'
SELECT MONTH(tanggal) AS bulan, SUM(nominal) AS total
FROM `expenses`
WHERE `user_id` = '10'
GROUP BY MONTH(tanggal)
ORDER BY `bulan`
---
    public function index()
    {
        $expenseModel = new ExpenseModel();
        $categoryModel = new CategoryModel();

        $userId = session()->get('user_id');

        // Total pengeluaran bulan ini
        $totalBulanIni = $expenseModel
            ->where('user_id', $userId)
            ->where('MONTH(tanggal)', date('m'))
            ->where('YEAR(tanggal)', date('Y'))
            ->selectSum('nominal')
            ->first()['nominal'] ?? 0;

        // Total transaksi
        $totalTransaksi = $expenseModel->where('user_id', $userId)->countAllResults();

        // Total kategori
        $totalKategori = $categoryModel->where('user_id', $userId)->countAllResults();

        // Data untuk grafik
        $builder = $expenseModel
            ->select("MONTH(tanggal) AS bulan, SUM(nominal) AS total")
            ->where('user_id', $userId)
            ->groupBy("MONTH(tanggal)")
            ->orderBy("bulan")
            ->findAll();