app/Controllers/Expenses.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        $expenseModel = new ExpenseModel();
        $categoryModel = new CategoryModel();

        $bulan = $this->request->getGet('bulan');
        $tahun = $this->request->getGet('tahun');

        $builder = $expenseModel
            ->select('expenses.*, categories.nama_kategori')
            ->join('categories', 'categories.id = expenses.kategori_id')
            ->where('expenses.user_id', session()->get('user_id'))
            ->orderBy('expenses.tanggal', 'DESC');

        if ($bulan && $tahun) {
            $builder->where('MONTH(tanggal)', $bulan)
                ->where('YEAR(tanggal)', $tahun);
        }

        $data['expenses'] = $builder->findAll();
        $data['categories'] = $categoryModel
            ->where('user_id', session()->get('user_id'))
            ->findAll();

        // Total pengeluaran bulan itu
        $data['total'] = $expenseModel
            ->where('user_id', session()->get('user_id'))
            ->where('MONTH(tanggal)', $bulan)
            ->where('YEAR(tanggal)', $tahun)
            ->selectSum('nominal')
            ->get()
            ->getRow()
            ->nominal ?? 0;
---
SELECT `expenses`.*, `categories`.`nama_kategori`
FROM `expenses`
JOIN `categories` ON `categories`.`id` = `expenses`.`kategori_id`
WHERE `expenses`.`user_id` = '10'
ORDER BY `expenses`.`tanggal` DESC
SELECT *
FROM `categories`
WHERE `user_id` = '10'
SELECT SUM(`nominal`) AS `nominal`
FROM `expenses`
WHERE `user_id` = '10'
AND MONTH(tanggal) IS NULL
AND YEAR(tanggal) IS NULL

    public function chart()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        $expenseModel = new ExpenseModel();

        // Ambil total pengeluaran per bulan untuk tahun ini
        $query = $expenseModel
            ->select('MONTH(tanggal) as bulan, SUM(nominal) as total')
            ->where('user_id', session()->get('user_id'))
            ->where('YEAR(tanggal)', date('Y'))
            ->groupBy('bulan')
            ->orderBy('bulan', 'ASC')
            ->get();
---
SELECT MONTH(tanggal) as bulan, SUM(nominal) as total
FROM `expenses`
WHERE `user_id` = '10'
AND YEAR(tanggal) = '2025'
GROUP BY `bulan`
ORDER BY `bulan` ASC

    public function exportPDF()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        // Load DOMPDF via Composer
        require_once APPPATH . 'Libraries/dompdf/autoload.inc.php';
        $dompdf = new \Dompdf\Dompdf();

        $expenseModel = new ExpenseModel();
        $expenses = $expenseModel
            ->select('expenses.*, categories.nama_kategori')
            ->join('categories', 'categories.id = expenses.kategori_id')
            ->where('expenses.user_id', session()->get('user_id'))
            ->orderBy('expenses.tanggal', 'DESC')
            ->findAll();
---
SELECT `expenses`.*, `categories`.`nama_kategori`
FROM `expenses`
JOIN `categories` ON `categories`.`id` = `expenses`.`kategori_id`
WHERE `expenses`.`user_id` = '10'
ORDER BY `expenses`.`tanggal` DESC

    public function create()
    {
        $categoriesModel = new CategoryModel();
        $data['categories'] = $categoriesModel->where('user_id', session()->get('user_id'))->findAll();
---
SELECT *
FROM `categories`
WHERE `user_id` = '10'

    public function store()
    {
        $model = new \App\Models\ExpenseModel();

        $data = [
            'user_id'           => session('user_id'),
            'kategori_id'       => $this->request->getPost('kategori_id'),
            'nama_pengeluaran'  => $this->request->getPost('nama'),
            'nominal'           => $this->request->getPost('nominal'),
            'tanggal'           => $this->request->getPost('tanggal'),
            'catatan'           => $this->request->getPost('catatan'),
        ];

        if (empty($data['nama_pengeluaran']) || empty($data['kategori_id']) || empty($data['nominal']) || empty($data['tanggal'])) {
            return redirect()->back()->with('error', 'Semua field wajib diisi');
        }

        $model->insert($data);
---
INSERT INTO `expenses` (`user_id`, `kategori_id`, `nama_pengeluaran`, `nominal`, `tanggal`, `catatan`) VALUES ('10', '13', 'Makan', '50000', '2025-07-17', 'Membeli bakso')

    public function update($id)
    {
        $model = new \App\Models\ExpenseModel();
        $expense = $model->find($id);

        if (!$expense || $expense['user_id'] != session('user_id')) {
            return redirect()->to('/expenses')->with('error', 'Data tidak ditemukan');
        }

        $data = [
            'kategori_id'       => $this->request->getPost('kategori_id'),
            'nama_pengeluaran'  => $this->request->getPost('nama'),
            'nominal'           => $this->request->getPost('nominal'),
            'tanggal'           => $this->request->getPost('tanggal'),
            'catatan'           => $this->request->getPost('catatan'),
        ];

        if (empty($data['nama_pengeluaran']) || empty($data['kategori_id']) || empty($data['nominal']) || empty($data['tanggal'])) {
            return redirect()->back()->with('error', 'Semua field wajib diisi');
        }

        $model->update($id, $data);
---
SELECT *
FROM `expenses`
WHERE `expenses`.`id` = '12'
UPDATE `expenses` SET `kategori_id` = '13', `nama_pengeluaran` = 'Makan', `nominal` = '50000.00', `tanggal` = '2025-07-17', `catatan` = 'Membeli bakso'
WHERE `expenses`.`id` IN ('12')

    public function edit($id)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        $model = new \App\Models\ExpenseModel();
        $categoryModel = new \App\Models\CategoryModel();
        $expense = $model->find($id);

        if (!$expense || $expense['user_id'] != session('user_id')) {
            return redirect()->to('/expenses')->with('error', 'Data tidak ditemukan');
        }

        $data['expense'] = $expense;
        $data['categories'] = $categoryModel->where('user_id', session()->get('user_id'))->findAll();
---
SELECT *
FROM `expenses`
WHERE `expenses`.`id` = '12'
SELECT *
FROM `categories`
WHERE `user_id` = '10'